Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF13SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF13SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD84">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF13SID3" edc:desc="" edc:mask="0x1" edc:name="RXF13SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID4" edc:desc="" edc:mask="0x1" edc:name="RXF13SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID5" edc:desc="" edc:mask="0x1" edc:name="RXF13SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID6" edc:desc="" edc:mask="0x1" edc:name="RXF13SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID7" edc:desc="" edc:mask="0x1" edc:name="RXF13SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID8" edc:desc="" edc:mask="0x1" edc:name="RXF13SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID9" edc:desc="" edc:mask="0x1" edc:name="RXF13SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID10" edc:desc="" edc:mask="0x1" edc:name="RXF13SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF13SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF13SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD85">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF13EID16" edc:desc="" edc:mask="0x1" edc:name="RXF13EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID17" edc:desc="" edc:mask="0x1" edc:name="RXF13EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF13EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF13EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID0" edc:desc="" edc:mask="0x1" edc:name="RXF13SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID1" edc:desc="" edc:mask="0x1" edc:name="RXF13SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13SID2" edc:desc="" edc:mask="0x1" edc:name="RXF13SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF13EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF13EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF13EID8" edc:desc="" edc:mask="0x1" edc:name="RXF13EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID9" edc:desc="" edc:mask="0x1" edc:name="RXF13EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID10" edc:desc="" edc:mask="0x1" edc:name="RXF13EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID11" edc:desc="" edc:mask="0x1" edc:name="RXF13EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID12" edc:desc="" edc:mask="0x1" edc:name="RXF13EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID13" edc:desc="" edc:mask="0x1" edc:name="RXF13EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID14" edc:desc="" edc:mask="0x1" edc:name="RXF13EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID15" edc:desc="" edc:mask="0x1" edc:name="RXF13EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
